-- 01
-- Расписать словами как планируете реализовать данную задачу.
-- Что конкретно расписать:
-- а) что планируете хранить в витрине. в каком разрезе.
-- б) сколько по времени будет храниться инфа в вашей витрине, как будет она будет удаляться.
-- в) какой движок планируете использовать и почему.
-- г) какая сортировка и почему.
-- д) как в даге будете обновлять уже имеющуюся в витрине инфу и что конкретно обновлять.
-- е) как в даге будете подливать новую инфу. как сделаете инкрементальность.


-- 02
-- Сделать витрину для отчета.


-- 03
-- Заполнить ее за всю историю 30 дней.
-- Квантили использовать не нужно. Достаточно выполнить весь код из 11 домашки.
-- Здесь приложить результат запроса по Кол-ву строк в вашей витрине.


-- 04
-- Сделать даг.
-- github MergeRequest
-- Не забыть про пункты и Задачи-1:
-- д) как в даге будете обновлять уже имеющуюся в витрине инфу и что конкретно обновлять.
-- е) как в даге будете подливать новую инфу. как сделаете инкрементальность.